hw5/hw5-files/index.org
# -*- org-export-html-postamble:t; -*-
#+TITLE: CSC 578 HW 5: Backprop Hyper-Parameters
#+DATE: 
#+EMAIL: 
#+AUTHOR: Fall 2020

#+OPTIONS:   H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t 
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assignstyles.css" />

#+LATEX_HEADER: \usepackage[margin=1in]{geometry}

(Version 0.01, with much credit again to Prof. Tomuro)

*Graded out of 10 points.*

Do all questions

[[./hw5-files.zip][Here is a zip file with all of the files for this homework]]

-----
* TODO COMMENT
  - [X] Links to lectures
  - [X] Fix the reference to Function Class notes?
  - [X] Add lmbda to here and answers
  - [X] Default regularization = none
  - [X] Same sort of checklist as last time
  - [X] Make a zip file and link

* Overview

Similar to HW#3, you make required modifications to the NNDL book code and write a small application code.  The objective of the assignment is to enhance you understanding of some of the hyper-parameters of neural networks.

The original NNDL code "network2.py" is hard-coding several things, including the sigmoid activation function, L2 regularization and the input data format (for MNIST).  In this assignment, we make the code general so that it (implements and) accepts various hyper-parameters as (literally) parameters of the network.

For the application code, you do some systematic experiments that test various combinations of the hyper-parameter values.

*Note:* This homework is not as tightly specified as HW#3.  You may need to *do your own research* to find out how best to implement a few things.
----- 
* 1. Network Code (in [[./NN578_network2.py][NN578_network2.py]])

** Intro
  For this part, you will need to make modifications to the Network Code, adding some hyper-parameters and modifying some functions.

  - (A) Hyper-parameters:

    - Cost function
      - QuadraticCost, CrossEntropy, LogLikelihood
    - Activation function
      - Sigmoid, Tanh, ReLU, Softmax
    - Regularization
      - L1 and L2
    - Dropout rate

  - (B) Functions to modify (minimally):

    - set_parameters()
    - feedforward()
    - backprop()
    - update_mini_batch()
    - total_cost()

Note that you may need to modify other functions additionally to implement Dropout.

-----

** (A) Hyper-parameters
   Hyper-parameters are passed in through keyword arguments in the constructor/init (*cost, act_hidden, act_output, regularization*, and *dropoutpercent*). The values are stored in the (additional) instance variables as shown below:
#+begin_src python
    ## Additional keyword arguments for hyper-parameters
    def __init__(self, sizes, cost=CrossEntropyCost, act_hidden=Sigmoid,
                 act_output=None, regularization=None, lmbda=0.0,
                 dropoutpercent=0.0):
        """The list ``sizes`` contains the number of neurons in the respective
        layers of the network.  For example, if the list was [2, 3, 1]
        then it would be a three-layer network, with the first layer
        containing 2 neurons, the second layer 3 neurons, and the
        third layer 1 neuron.  The biases and weights for the network
        are initialized randomly, using
        ``self.default_weight_initializer`` (see docstring for that method).
        """
        self.num_layers = len(sizes)
        self.sizes = sizes
        self.default_weight_initializer()
        
        self.set_parameters(cost, act_hidden, act_output, regularization, lmbda,
                            dropoutpercent)

    ## nt: THIS NEEDS CHANGE.
    ## nt: convenience function for setting network hyperparameters
    def set_parameters(self, cost=QuadraticCost, act_hidden=Sigmoid,
                       act_output=None, regularization=None, lmbda=0.0,
                       dropoutpercent=0.0):
        self.cost=cost
        self.act_hidden = act_hidden
        if act_output == None:
            self.act_output = self.act_hidden
        else:
            self.act_output = act_output
        self.regularization = regularization
        self.lmbda = lmbda
        self.dropoutpercent = dropoutpercent
#+end_src


# *** Arguments

