hw5/hw5-files/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-18 Sun 19:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSC 578 HW 5: Backprop Hyper-Parameters</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fall 2020" />
<link rel="stylesheet" type="text/css" href="../assignstyles.css" />
</head>
<body>
<div id="content">
<h1 class="title">CSC 578 HW 5: Backprop Hyper-Parameters</h1>
<p>
(Version 0.01, with much credit again to Prof. Tomuro)
</p>

<p>
<b>Graded out of 10 points.</b>
</p>

<p>
Do all questions
</p>

<p>
<a href="./hw5-files.zip">Here is a zip file with all of the files for this homework</a>
</p>

<hr />
<div id="outline-container-org8e23623" class="outline-2">
<h2 id="org8e23623">Overview</h2>
<div class="outline-text-2" id="text-org8e23623">
<p>
Similar to HW#3, you make required modifications to the NNDL book code and write a small application code.  The objective of the assignment is to enhance you understanding of some of the hyper-parameters of neural networks.
</p>

<p>
The original NNDL code "network2.py" is hard-coding several things, including the sigmoid activation function, L2 regularization and the input data format (for MNIST).  In this assignment, we make the code general so that it (implements and) accepts various hyper-parameters as (literally) parameters of the network.
</p>

<p>
For the application code, you do some systematic experiments that test various combinations of the hyper-parameter values.
</p>

<p>
<b>Note:</b> This homework is not as tightly specified as HW#3.  You may need to <b>do your own research</b> to find out how best to implement a few things.
</p>
<hr />
</div>
</div>
<div id="outline-container-orgc6fd785" class="outline-2">
<h2 id="orgc6fd785">1. Network Code (in <a href="./NN578_network2.py">NN578_network2.py</a>)</h2>
<div class="outline-text-2" id="text-orgc6fd785">
</div>
<div id="outline-container-orgc0f6e15" class="outline-3">
<h3 id="orgc0f6e15">Intro</h3>
<div class="outline-text-3" id="text-orgc0f6e15">
<p>
For this part, you will need to make modifications to the Network Code, adding some hyper-parameters and modifying some functions.
</p>

<ul class="org-ul">
<li>(A) Hyper-parameters:

<ul class="org-ul">
<li>Cost function
<ul class="org-ul">
<li>QuadraticCost, CrossEntropy, LogLikelihood</li>
</ul></li>
<li>Activation function
<ul class="org-ul">
<li>Sigmoid, Tanh, ReLU, Softmax</li>
</ul></li>
<li>Regularization
<ul class="org-ul">
<li>L1 and L2</li>
</ul></li>
<li>Dropout rate</li>
</ul></li>

<li>(B) Functions to modify (minimally):

<ul class="org-ul">
<li>set_parameters()</li>
<li>feedforward()</li>
<li>backprop()</li>
<li>update_mini_batch()</li>
<li>total_cost()</li>
</ul></li>
</ul>

<p>
Note that you may need to modify other functions additionally to implement Dropout.
</p>

<hr />
</div>
</div>

<div id="outline-container-org30abf9f" class="outline-3">
<h3 id="org30abf9f">(A) Hyper-parameters</h3>
<div class="outline-text-3" id="text-org30abf9f">
<p>
Hyper-parameters are passed in through keyword arguments in the constructor/init (<b>cost, act_hidden, act_output, regularization</b>, and <b>dropoutpercent</b>). The values are stored in the (additional) instance variables as shown below:
</p>
<div class="org-src-container">
<pre class="src src-python">## Additional keyword arguments for hyper-parameters
def __init__(self, sizes, cost=CrossEntropyCost, act_hidden=Sigmoid,
             act_output=None, regularization=None, lmbda=0.0,
             dropoutpercent=0.0):
    """The list ``sizes`` contains the number of neurons in the respective
    layers of the network.  For example, if the list was [2, 3, 1]
    then it would be a three-layer network, with the first layer
    containing 2 neurons, the second layer 3 neurons, and the
    third layer 1 neuron.  The biases and weights for the network
    are initialized randomly, using
    ``self.default_weight_initializer`` (see docstring for that method).
    """
    self.num_layers = len(sizes)
    self.sizes = sizes
    self.default_weight_initializer()

    self.set_parameters(cost, act_hidden, act_output, regularization, lmbda,
                        dropoutpercent)

## nt: THIS NEEDS CHANGE.
## nt: convenience function for setting network hyperparameters
def set_parameters(self, cost=QuadraticCost, act_hidden=Sigmoid,
                   act_output=None, regularization=None, lmbda=0.0,
                   dropoutpercent=0.0):
    self.cost=cost
    self.act_hidden = act_hidden
    if act_output == None:
        self.act_output = self.act_hidden
    else:
        self.act_output = act_output
    self.regularization = regularization
    self.lmbda = lmbda
    self.dropoutpercent = dropoutpercent
</pre>
</div>
</div>
