hw5/hw5-files/index.tex
% Created 2020-10-18 Sun 19:38
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Fall 2020}
\date{}
\title{CSC 578 HW 5: Backprop Hyper-Parameters}
\begin{document}

\maketitle
(Version 0.01, with much credit again to Prof. Tomuro)

\textbf{Graded out of 10 points.}

Do all questions

\href{./hw5-files.zip}{Here is a zip file with all of the files for this homework}

\noindent\rule{\textwidth}{0.5pt}
\section*{Overview}
\label{sec:org1aeeb50}

Similar to HW\#3, you make required modifications to the NNDL book code and write a small application code.  The objective of the assignment is to enhance you understanding of some of the hyper-parameters of neural networks.

The original NNDL code "network2.py" is hard-coding several things, including the sigmoid activation function, L2 regularization and the input data format (for MNIST).  In this assignment, we make the code general so that it (implements and) accepts various hyper-parameters as (literally) parameters of the network.

For the application code, you do some systematic experiments that test various combinations of the hyper-parameter values.

\textbf{Note:} This homework is not as tightly specified as HW\#3.  You may need to \textbf{do your own research} to find out how best to implement a few things.

\noindent\rule{\textwidth}{0.5pt}
\section*{1. Network Code (in \href{./NN578\_network2.py}{NN578\_network2.py})}
\label{sec:orgf9065fa}

\subsection*{Intro}
\label{sec:orgba83851}
For this part, you will need to make modifications to the Network Code, adding some hyper-parameters and modifying some functions.

\begin{itemize}
\item (A) Hyper-parameters:

\begin{itemize}
\item Cost function
\begin{itemize}
\item QuadraticCost, CrossEntropy, LogLikelihood
\end{itemize}
\item Activation function
\begin{itemize}
\item Sigmoid, Tanh, ReLU, Softmax
\end{itemize}
\item Regularization
\begin{itemize}
\item L1 and L2
\end{itemize}
\item Dropout rate
\end{itemize}

\item (B) Functions to modify (minimally):

\begin{itemize}
\item set\_parameters()
\item feedforward()
\item backprop()
\item update\_mini\_batch()
\item total\_cost()
\end{itemize}
\end{itemize}

Note that you may need to modify other functions additionally to implement Dropout.

\noindent\rule{\textwidth}{0.5pt}

\subsection*{(A) Hyper-parameters}
\label{sec:org7b2a97a}
Hyper-parameters are passed in through keyword arguments in the constructor/init (\textbf{cost, act\_hidden, act\_output, regularization}, and \textbf{dropoutpercent}). The values are stored in the (additional) instance variables as shown below:
\begin{verbatim}
## Additional keyword arguments for hyper-parameters
def __init__(self, sizes, cost=CrossEntropyCost, act_hidden=Sigmoid,
             act_output=None, regularization=None, lmbda=0.0,
             dropoutpercent=0.0):
    """The list ``sizes`` contains the number of neurons in the respective
    layers of the network.  For example, if the list was [2, 3, 1]
    then it would be a three-layer network, with the first layer
    containing 2 neurons, the second layer 3 neurons, and the
    third layer 1 neuron.  The biases and weights for the network
    are initialized randomly, using
    ``self.default_weight_initializer`` (see docstring for that method).
    """
    self.num_layers = len(sizes)
    self.sizes = sizes
    self.default_weight_initializer()

    self.set_parameters(cost, act_hidden, act_output, regularization, lmbda,
                        dropoutpercent)

## nt: THIS NEEDS CHANGE.
## nt: convenience function for setting network hyperparameters
def set_parameters(self, cost=QuadraticCost, act_hidden=Sigmoid,
                   act_output=None, regularization=None, lmbda=0.0,
                   dropoutpercent=0.0):
    self.cost=cost
    self.act_hidden = act_hidden
    if act_output == None:
        self.act_output = self.act_hidden
    else:
        self.act_output = act_output
    self.regularization = regularization
    self.lmbda = lmbda
    self.dropoutpercent = dropoutpercent
\end{verbatim}
