hw5/hw5-files/index.org
*** 1. cost
     - This hyper-parameter argument specifies the cost function.
     - Options are 'QuadraticCost', 'CrossEntropy', 'LogLikelihood'.

     - Each one must be implemented as a class.  The scheme for class function is explained later in this document (see [[Class Function notes]] below).
     - The class should have two static functions: *fn()* executes the definition of the function (to compute the cost in during evaluation), and *derivative()* executes the function's derivative (to compute the error during learning).  No other function such as delta() should be defined in the class because they are not necessary for this assignment.
       1. *QuadraticCost* is fully implemented already in the starter code, as shown below (and you do not need to modify it).
       2. *CrossEntropy* is partially written (by taking fn() from the original NNDL code "network2.py").  You must add *derivative()*.
       3. You will write a whole class *LogLikelihood*.
       #+begin_src python
               class QuadraticCost(object):

                   @staticmethod
                   def fn(a, y):
                       """Return the cost associated with an output ``a``
                       and desired output ``y``.
                       """
                       return 0.5*np.linalg.norm(y-a)**2

                   ## nt: addition
                   @staticmethod
                   def derivative(a, y):
                       """Return the first derivative of the function."""
                       return -(y-a)

               class CrossEntropyCost(object):

                   @staticmethod
                   def fn(a, y):
                       """Return the cost associated with an output ``a`` 
                       and desired output ``y``.
                       """
                       return np.sum(np.nan_to_num(-y*np.log(a)-(1-y)*np.log(1-a)))

                   @staticmethod
                   def derivative(a, y):
                       """Return the first derivative of the function."""
                       ###
                       ### YOU WRITE YOUR CODE HERE
                       ###
#+end_src


     - Both functions receive =a= (activation) and =y= (target output), which are from one data instance and represented by column vectors.
     - =fn()= returns a *scalar*, while =derivative()= returns a *column vector* (containing the cost derivative for each node in the output layer; no multiplication by the derivative of the activation function).

     - _NOTES on *LogLikelihood*_:
       1. This cost function should really be used when *'act_output'* (the activation function of the output layer) = *'Softmax'*.  You can check for it if you like (and print warning or abort execution, for instance), but that's not a requirement for the homework.
       2. For its function and derivative formula, you can look at the [[https://depaul.zoom.us/rec/play/-9zBvchXodIQ6F1wN-eVXaAyOZpdjHMcA_4BT6tPrXkkqEQb9frddpOd8p0FfTy7Zl5l4Zj8foa3Gp2O.cwaBIuqKYIq9Kojv?continueMode=true&_x_zm_rtaid=0hXVYogNTWeL_9zcHvWxRA.1603064569512.dec1409ec0c39f5fdf363070d27a6cee&_x_zm_rhtaid=174][week 3 video]] at about 2:11 in.  For =derivative()=, you compute the derivative of the node for which the target output is 1.  For other nodes, the value should be 0.
             
