hw5/hw5-files/index.html

<div id="outline-container-org4d8673b" class="outline-4">
<h4 id="org4d8673b">1. cost</h4>
<div class="outline-text-4" id="text-org4d8673b">
<ul class="org-ul">
<li>This hyper-parameter argument specifies the cost function.</li>
<li>Options are 'QuadraticCost', 'CrossEntropy', 'LogLikelihood'.</li>

<li>Each one must be implemented as a class.  The scheme for class function is explained later in this document (see <a href="#org0a0432d">Class Function notes</a> below).</li>
<li><p>
The class should have two static functions: <b>fn()</b> executes the definition of the function (to compute the cost in during evaluation), and <b>derivative()</b> executes the function's derivative (to compute the error during learning).  No other function such as delta() should be defined in the class because they are not necessary for this assignment.
</p>
<ol class="org-ol">
<li><b>QuadraticCost</b> is fully implemented already in the starter code, as shown below (and you do not need to modify it).</li>
<li><b>CrossEntropy</b> is partially written (by taking fn() from the original NNDL code "network2.py").  You must add <b>derivative()</b>.</li>
<li>You will write a whole class <b>LogLikelihood</b>.</li>
</ol>
<div class="org-src-container">
<pre class="src src-python">class QuadraticCost(object):

    @staticmethod
    def fn(a, y):
        """Return the cost associated with an output ``a``
        and desired output ``y``.
        """
        return 0.5*np.linalg.norm(y-a)**2

    ## nt: addition
    @staticmethod
    def derivative(a, y):
        """Return the first derivative of the function."""
        return -(y-a)

class CrossEntropyCost(object):

    @staticmethod
    def fn(a, y):
        """Return the cost associated with an output ``a`` 
        and desired output ``y``.
        """
        return np.sum(np.nan_to_num(-y*np.log(a)-(1-y)*np.log(1-a)))

    @staticmethod
    def derivative(a, y):
        """Return the first derivative of the function."""
        ###
        ### YOU WRITE YOUR CODE HERE
        ###
</pre>
</div></li>
</ul>


<ul class="org-ul">
<li>Both functions receive <code>a</code> (activation) and <code>y</code> (target output), which are from one data instance and represented by column vectors.</li>
<li><code>fn()</code> returns a <b>scalar</b>, while <code>derivative()</code> returns a <b>column vector</b> (containing the cost derivative for each node in the output layer; no multiplication by the derivative of the activation function).</li>

<li><span class="underline">NOTES on <b>LogLikelihood</b></span>:
<ol class="org-ol">
<li>This cost function should really be used when <b>'act_output'</b> (the activation function of the output layer) = <b>'Softmax'</b>.  You can check for it if you like (and print warning or abort execution, for instance), but that's not a requirement for the homework.</li>
<li>For its function and derivative formula, you can look at the <a href="https://depaul.zoom.us/rec/play/-9zBvchXodIQ6F1wN-eVXaAyOZpdjHMcA_4BT6tPrXkkqEQb9frddpOd8p0FfTy7Zl5l4Zj8foa3Gp2O.cwaBIuqKYIq9Kojv?continueMode=true&amp;_x_zm_rtaid=0hXVYogNTWeL_9zcHvWxRA.1603064569512.dec1409ec0c39f5fdf363070d27a6cee&amp;_x_zm_rhtaid=174">week 3 video</a> at about 2:11 in.  For <code>derivative()</code>, you compute the derivative of the node for which the target output is 1.  For other nodes, the value should be 0.</li>
</ol></li>
</ul>
</div>
</div>
