hw5/hw5-files/index.tex

\subsubsection*{1. cost}
\label{sec:orgb44740b}
\begin{itemize}
\item This hyper-parameter argument specifies the cost function.
\item Options are 'QuadraticCost', 'CrossEntropy', 'LogLikelihood'.

\item Each one must be implemented as a class.  The scheme for class function is explained later in this document (see \hyperref[sec:org77df2bb]{Class Function notes} below).
\item The class should have two static functions: \textbf{fn()} executes the definition of the function (to compute the cost in during evaluation), and \textbf{derivative()} executes the function's derivative (to compute the error during learning).  No other function such as delta() should be defined in the class because they are not necessary for this assignment.
\begin{enumerate}
\item \textbf{QuadraticCost} is fully implemented already in the starter code, as shown below (and you do not need to modify it).
\item \textbf{CrossEntropy} is partially written (by taking fn() from the original NNDL code "network2.py").  You must add \textbf{derivative()}.
\item You will write a whole class \textbf{LogLikelihood}.
\end{enumerate}
\begin{verbatim}
class QuadraticCost(object):

    @staticmethod
    def fn(a, y):
        """Return the cost associated with an output ``a``
        and desired output ``y``.
        """
        return 0.5*np.linalg.norm(y-a)**2

    ## nt: addition
    @staticmethod
    def derivative(a, y):
        """Return the first derivative of the function."""
        return -(y-a)

class CrossEntropyCost(object):

    @staticmethod
    def fn(a, y):
        """Return the cost associated with an output ``a`` 
        and desired output ``y``.
        """
        return np.sum(np.nan_to_num(-y*np.log(a)-(1-y)*np.log(1-a)))

    @staticmethod
    def derivative(a, y):
        """Return the first derivative of the function."""
        ###
        ### YOU WRITE YOUR CODE HERE
        ###
\end{verbatim}
\end{itemize}


\begin{itemize}
\item Both functions receive \texttt{a} (activation) and \texttt{y} (target output), which are from one data instance and represented by column vectors.
\item \texttt{fn()} returns a \textbf{scalar}, while \texttt{derivative()} returns a \textbf{column vector} (containing the cost derivative for each node in the output layer; no multiplication by the derivative of the activation function).

\item \uline{NOTES on \textbf{LogLikelihood}}:
\begin{enumerate}
\item This cost function should really be used when \textbf{'act\_output'} (the activation function of the output layer) = \textbf{'Softmax'}.  You can check for it if you like (and print warning or abort execution, for instance), but that's not a requirement for the homework.
\item For its function and derivative formula, you can look at the \href{https://depaul.zoom.us/rec/play/-9zBvchXodIQ6F1wN-eVXaAyOZpdjHMcA\_4BT6tPrXkkqEQb9frddpOd8p0FfTy7Zl5l4Zj8foa3Gp2O.cwaBIuqKYIq9Kojv?continueMode=true\&\_x\_zm\_rtaid=0hXVYogNTWeL\_9zcHvWxRA.1603064569512.dec1409ec0c39f5fdf363070d27a6cee\&\_x\_zm\_rhtaid=174}{week 3 video} at about 2:11 in.  For \texttt{derivative()}, you compute the derivative of the node for which the target output is 1.  For other nodes, the value should be 0.
\end{enumerate}
\end{itemize}
