hw5/hw5-files/index.html

<div id="outline-container-orgb444dd4" class="outline-4">
<h4 id="orgb444dd4">2. act_hidden</h4>
<div class="outline-text-4" id="text-orgb444dd4">
<ul class="org-ul">
<li>This parameter specifies the activation function for nodes on <b>all</b> hidden layers, but EXCLUDING the output layer.</li>
<li>Parameter options are 'Sigmoid', 'Tanh', 'ReLU', 'Softmax'.</li>

<li><p>
Each one must be implemented as a class (see <a href="#org0a0432d">Class Function notes</a> below).  The class should have two functions: a static method <b><code>fn()</code></b> executes the definition of the function (to compute the node activation value), and a class method <b><code>derivative()</code></b> executes the function's derivative (to compute the error during learning).
</p>

<ol class="org-ol">
<li><b><code>Sigmoid</code></b> is fully implemented already in the starter code, as shown below (and you do not need to modify it).</li>
<li><b><code>Softmax</code></b> is partially written.  You must add <b><code>derivative()</code></b>.  Note that, since its derivative (already written) returns a 2D matrix instead of a vector (<a href="https://medium.com/@aerinykim/how-to-implement-the-softmax-derivative-independently-from-any-loss-function-ae6d44363a9d">reference</a>), it is handled differently in computing the error/delta in <code>backprop()</code>.  See <a href="#org0a0432d">Class Function notes</a> below.  But for the purpose of writing the class, you only fill in the definition of the function in <b><code>fn()</code></b>.</li>
<li>For <b>Tanh</b>, a skeleton class is already written.  You complete the class.</li>
<li>You write a whole class for <b>ReLU</b>.</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">class Sigmoid(object):    
    @staticmethod
    def fn(z):
        """The sigmoid function."""
        return 1.0/(1.0+np.exp(-z))

    @classmethod
    def derivative(cls,z):
        """Derivative of the sigmoid function."""
        return cls.fn(z)*(1-cls.fn(z))

class Softmax(object):
    @staticmethod
    # Parameter z is an array of shape (len(z), 1).
    def fn(z):
        """The softmax of vector z."""
        ###
        ### YOU WRITE YOUR CODE HERE
        ###

    @classmethod
    def derivative(cls,z):
        """Derivative of the softmax.  
        IMPORTANT: The derivative is an N*N matrix.
        """
        a = cls.fn(z) # obtain the softmax vector
        return np.diagflat(a) - np.dot(a, a.T)
</pre>
</div>

<p>
For those functions, you can look at the <a href="https://depaul.zoom.us/rec/play/-9zBvchXodIQ6F1wN-eVXaAyOZpdjHMcA_4BT6tPrXkkqEQb9frddpOd8p0FfTy7Zl5l4Zj8foa3Gp2O.cwaBIuqKYIq9Kojv?continueMode=true&amp;_x_zm_rtaid=0hXVYogNTWeL_9zcHvWxRA.1603064569512.dec1409ec0c39f5fdf363070d27a6cee&amp;_x_zm_rhtaid=174">Recorded zoom session</a> from Week 3 (about 1:10 in) and/or the Review slides from Week 4 for the definitions.
</p>

<p>
Note that, although Softmax is almost never used for hidden layers, we do not have to disallow it in this homework.   
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org4c168be" class="outline-4">
<h4 id="org4c168be">3. act_output</h4>
<div class="outline-text-4" id="text-org4c168be">
<ul class="org-ul">
<li>This parameter specifies the activation function for nodes on the output layer.</li>
<li><p>
Parameter options are 'Sigmoid', 'Tanh' and 'Softmax'. 
</p>

<p>
<span class="underline">NOTES on Tanh</span>:  If Tanh is selected as the activation function for the output layer:
</p>
<ol class="org-ol">
<li>Because the output value will be between 1 and -1 (instead of 1 and 0), the only cost function that goes with Tanh is the quadratic cost.  So if the cost function was set to anything besides 'QuadraticCost', change/overwrite the cost function to QuadraticCost and print a warning (to the user, e.g. "Tanh only accepts 'QuadraticCost' cost function.  Changing to QuadraticCost..").  <b>You must add code to do it by yourself</b>, in <code>set_parameters()</code>.</li>

<li>Note that, in the network startup code (<a href="./NN578_network2.py">NN578_network2.py</a>), some code is added (in <code>SGD()</code>) that changes the dataset when the output layer's activation is Tanh, in particular to make the target y values to be 1 or -1 (instead of 1 or 0).  It is already written for you, so you don't need to be concerned about the data.</li>
</ol></li>
</ul>
</div>
</div>
