hw5/hw5-files/index.tex

\subsubsection*{2. act\_hidden}
\label{sec:org913a774}
\begin{itemize}
\item This parameter specifies the activation function for nodes on \textbf{all} hidden layers, but EXCLUDING the output layer.
\item Parameter options are 'Sigmoid', 'Tanh', 'ReLU', 'Softmax'.

\item Each one must be implemented as a class (see \hyperref[sec:org77df2bb]{Class Function notes} below).  The class should have two functions: a static method \textbf{\texttt{fn()}} executes the definition of the function (to compute the node activation value), and a class method \textbf{\texttt{derivative()}} executes the function's derivative (to compute the error during learning).

\begin{enumerate}
\item \textbf{\texttt{Sigmoid}} is fully implemented already in the starter code, as shown below (and you do not need to modify it).
\item \textbf{\texttt{Softmax}} is partially written.  You must add \textbf{\texttt{derivative()}}.  Note that, since its derivative (already written) returns a 2D matrix instead of a vector (\href{https://medium.com/@aerinykim/how-to-implement-the-softmax-derivative-independently-from-any-loss-function-ae6d44363a9d}{reference}), it is handled differently in computing the error/delta in \texttt{backprop()}.  See \hyperref[sec:org77df2bb]{Class Function notes} below.  But for the purpose of writing the class, you only fill in the definition of the function in \textbf{\texttt{fn()}}.
\item For \textbf{Tanh}, a skeleton class is already written.  You complete the class.
\item You write a whole class for \textbf{ReLU}.
\end{enumerate}

\begin{verbatim}
class Sigmoid(object):    
    @staticmethod
    def fn(z):
        """The sigmoid function."""
        return 1.0/(1.0+np.exp(-z))

    @classmethod
    def derivative(cls,z):
        """Derivative of the sigmoid function."""
        return cls.fn(z)*(1-cls.fn(z))

class Softmax(object):
    @staticmethod
    # Parameter z is an array of shape (len(z), 1).
    def fn(z):
        """The softmax of vector z."""
        ###
        ### YOU WRITE YOUR CODE HERE
        ###

    @classmethod
    def derivative(cls,z):
        """Derivative of the softmax.  
        IMPORTANT: The derivative is an N*N matrix.
        """
        a = cls.fn(z) # obtain the softmax vector
        return np.diagflat(a) - np.dot(a, a.T)
\end{verbatim}

For those functions, you can look at the \href{https://depaul.zoom.us/rec/play/-9zBvchXodIQ6F1wN-eVXaAyOZpdjHMcA\_4BT6tPrXkkqEQb9frddpOd8p0FfTy7Zl5l4Zj8foa3Gp2O.cwaBIuqKYIq9Kojv?continueMode=true\&\_x\_zm\_rtaid=0hXVYogNTWeL\_9zcHvWxRA.1603064569512.dec1409ec0c39f5fdf363070d27a6cee\&\_x\_zm\_rhtaid=174}{Recorded zoom session} from Week 3 (about 1:10 in) and/or the Review slides from Week 4 for the definitions.

Note that, although Softmax is almost never used for hidden layers, we do not have to disallow it in this homework.
\end{itemize}

\subsubsection*{3. act\_output}
\label{sec:org62ec159}
\begin{itemize}
\item This parameter specifies the activation function for nodes on the output layer.
\item Parameter options are 'Sigmoid', 'Tanh' and 'Softmax'. 

\uline{NOTES on Tanh}:  If Tanh is selected as the activation function for the output layer:
\begin{enumerate}
\item Because the output value will be between 1 and -1 (instead of 1 and 0), the only cost function that goes with Tanh is the quadratic cost.  So if the cost function was set to anything besides 'QuadraticCost', change/overwrite the cost function to QuadraticCost and print a warning (to the user, e.g. "Tanh only accepts 'QuadraticCost' cost function.  Changing to QuadraticCost..").  \textbf{You must add code to do it by yourself}, in \texttt{set\_parameters()}.

\item Note that, in the network startup code (\href{./NN578\_network2.py}{NN578\_network2.py}), some code is added (in \texttt{SGD()}) that changes the dataset when the output layer's activation is Tanh, in particular to make the target y values to be 1 or -1 (instead of 1 or 0).  It is already written for you, so you don't need to be concerned about the data.
\end{enumerate}
\end{itemize}
