hw5/hw5-files/index.org
*** 4. regularization:
   - This parameter specifies the regularization method. 
   - Parameter options are 'L2' and 'L1'.
   - The selected method is applied to all hidden layers and the output layer. 
         
   - You can implement them in any way you like, for example as function classes or inline if-else conditionals.  For definitions/formulas and explanation, see the [[https://depaul.zoom.us/rec/share/HUia84Y0b_OkQT2c9n39dGkUlyvNU0LqtmnnCz7gQ0vJ50hF_up4sU0YWa4ABBQ.SS5hVQmvqRtOWFPa][Avoiding overfitting]] video from Week 3 or the review slides from Week 4.

     _IMPORTANT_: The start-up code has L2 hard-coded in (unchanged from the original NNDL code for this part).  *You make necessary changes to the code by yourself* to incorporate the two methods.
   - The regularization is relevant at two places in the backprop algorithm:
     1. During training, when weights are adjusted at the end of a mini-bath -- the function =update_mini_batch()=.
     2. During evaluation, when the cost is computed -- the function =total_cost()=.

     NOTE: Both of those functions have the parameter *lmbda*, passed in from the function =SGD()=.  You utilize its value in implementing the regularizations.

*** 5. dropoutpercent
   - This parameter specifies the percentage of dropout.  
   - The value is between 0 and 1.  For example, 0.4 means 40% of the nodes on a layer are dropped (or made inaccessible).
   - Dropout consists in randomly setting a fraction rate of units in a layer to 0 at each update during training time, which helps prevent overfitting.
   - Assume the same dropout percentage is applied to *all hidden layers*.  /Dropout should not be applied to input or output layer./
   -  You can implement the parameter in any way you like.  *You make necessary changes to the code by yourself, wherever needed.*
   - Many dropout schemes have been proposed in neural networks.  For this assignment, you implement the following scheme.
      1. Dropout is applied during the *training phase only*.  No dropout is applied during the testing/evaluation phrase.
      2. Use the same dropout nodes during one *mini-batch*.  That means you have to store which nodes were used/dropped somewhere else.  Think about it and implement in your way.
      3. *Scale* the output values of the layer.  This scheme is explained at [[https://wiseodd.github.io/techblog/2016/06/25/dropout/][this site]].  In particular, the following code is very useful. The first line is generating a dropout mask (=u1=) and the second line is applying the mask to the activation of a hidden layer (=h1=) during the *forward* propagation phase in the backprop function.
         #+begin_src python
            # Dropout training, notice the scaling of 1/p
            u1 = np.random.binomial(1, p, size=h1.shape) / p
            h1 *= u1
         #+end_src
         
         Then during the *backward* propagation phase, you apply the mask to the delta of a hidden layer (=dh1=).    This is necessary because, since a dropout mask is applied as an additional multiplier (function) after the activation function, it essentially became a constant coefficient of the activation function (i.e., =c*a(z)=), and shows up in the derivative of that function --  Let $f(z) = c*a(z)$, then $f'(z) = c*a'(z)$.

         #+begin_src python
            dh1 *= u1 
         #+end_src

            _IMPORTANT NOTES_:

              -  The variable =p= above is the ratio of nodes to RETAIN, not to remove.   So essentially, =p = 1 - self.dropoutpercent=.
              -  =np.random.binomial()= is *probabilistic*, so does not guarantee the p proportion of success.  But for the purpose of the assignment, it's fine to use it (i.e., the code above).  However, if you like to implement correctly, you can use =random.sample()= method in Python's standard library.
              -  During forward propagation, dropout should be applied to/after *activation*, NOT to the z/weighted sum (e.g. sigma(0) = 0.5, which is not right or convenient here).
              -  During backward propagation, dropout should be applied to the delta (the error at a given hidden layer).



*** Class Function notes

Static or class functions in a class can be called through the class name.  When a class name is bound to an instance variable, you can invoke a specific static/class function in the class by prefixing the instance variable.  For example, here is a line in the function =backprop()=:

#+begin_src python
a_prime = (self.act_output).derivative(zs[-1])
#+end_src

So whatever =self.act_output= is bound to (e.g. Sigmoid, Tanh, ReLU), the function =derivative()= defined inside the class is being invoked.

