hw5/hw5-files/index.html

<div id="outline-container-orga653eb9" class="outline-4">
<h4 id="orga653eb9">4. regularization:</h4>
<div class="outline-text-4" id="text-orga653eb9">
<ul class="org-ul">
<li>This parameter specifies the regularization method.</li>
<li>Parameter options are 'L2' and 'L1'.</li>
<li>The selected method is applied to all hidden layers and the output layer.</li>

<li><p>
You can implement them in any way you like, for example as function classes or inline if-else conditionals.  For definitions/formulas and explanation, see the <a href="https://depaul.zoom.us/rec/share/HUia84Y0b_OkQT2c9n39dGkUlyvNU0LqtmnnCz7gQ0vJ50hF_up4sU0YWa4ABBQ.SS5hVQmvqRtOWFPa">Avoiding overfitting</a> video from Week 3 or the review slides from Week 4.
</p>

<p>
<span class="underline">IMPORTANT</span>: The start-up code has L2 hard-coded in (unchanged from the original NNDL code for this part).  <b>You make necessary changes to the code by yourself</b> to incorporate the two methods.
</p></li>
<li><p>
The regularization is relevant at two places in the backprop algorithm:
</p>
<ol class="org-ol">
<li>During training, when weights are adjusted at the end of a mini-bath &#x2013; the function <code>update_mini_batch()</code>.</li>
<li>During evaluation, when the cost is computed &#x2013; the function <code>total_cost()</code>.</li>
</ol>

<p>
NOTE: Both of those functions have the parameter <b>lmbda</b>, passed in from the function <code>SGD()</code>.  You utilize its value in implementing the regularizations.
</p></li>
</ul>
</div>
</div>

<div id="outline-container-org7e1b825" class="outline-4">
<h4 id="org7e1b825">5. dropoutpercent</h4>
<div class="outline-text-4" id="text-org7e1b825">
<ul class="org-ul">
<li>This parameter specifies the percentage of dropout.</li>
<li>The value is between 0 and 1.  For example, 0.4 means 40% of the nodes on a layer are dropped (or made inaccessible).</li>
<li>Dropout consists in randomly setting a fraction rate of units in a layer to 0 at each update during training time, which helps prevent overfitting.</li>
<li>Assume the same dropout percentage is applied to <b>all hidden layers</b>.  <i>Dropout should not be applied to input or output layer.</i></li>
<li>You can implement the parameter in any way you like.  <b>You make necessary changes to the code by yourself, wherever needed.</b></li>
<li>Many dropout schemes have been proposed in neural networks.  For this assignment, you implement the following scheme.
<ol class="org-ol">
<li>Dropout is applied during the <b>training phase only</b>.  No dropout is applied during the testing/evaluation phrase.</li>
<li>Use the same dropout nodes during one <b>mini-batch</b>.  That means you have to store which nodes were used/dropped somewhere else.  Think about it and implement in your way.</li>
<li><p>
<b>Scale</b> the output values of the layer.  This scheme is explained at <a href="https://wiseodd.github.io/techblog/2016/06/25/dropout/">this site</a>.  In particular, the following code is very useful. The first line is generating a dropout mask (<code>u1</code>) and the second line is applying the mask to the activation of a hidden layer (<code>h1</code>) during the <b>forward</b> propagation phase in the backprop function.
</p>
<div class="org-src-container">
<pre class="src src-python"># Dropout training, notice the scaling of 1/p
u1 = np.random.binomial(1, p, size=h1.shape) / p
h1 *= u1
</pre>
</div>

<p>
Then during the <b>backward</b> propagation phase, you apply the mask to the delta of a hidden layer (<code>dh1</code>).    This is necessary because, since a dropout mask is applied as an additional multiplier (function) after the activation function, it essentially became a constant coefficient of the activation function (i.e., <code>c*a(z)</code>), and shows up in the derivative of that function &#x2013;  Let \(f(z) = c*a(z)\), then \(f'(z) = c*a'(z)\).
</p>

<div class="org-src-container">
<pre class="src src-python">dh1 *= u1 
</pre>
</div>

<p>
<span class="underline">IMPORTANT NOTES</span>:
</p>

<ul class="org-ul">
<li>The variable <code>p</code> above is the ratio of nodes to RETAIN, not to remove.   So essentially, <code>p = 1 - self.dropoutpercent</code>.</li>
<li><code>np.random.binomial()</code> is <b>probabilistic</b>, so does not guarantee the p proportion of success.  But for the purpose of the assignment, it's fine to use it (i.e., the code above).  However, if you like to implement correctly, you can use <code>random.sample()</code> method in Python's standard library.</li>
<li>During forward propagation, dropout should be applied to/after <b>activation</b>, NOT to the z/weighted sum (e.g. sigma(0) = 0.5, which is not right or convenient here).</li>
<li>During backward propagation, dropout should be applied to the delta (the error at a given hidden layer).</li>
</ul></li>
</ol></li>
</ul>
</div>
</div>



<div id="outline-container-org0a0432d" class="outline-4">
<h4 id="org0a0432d">Class Function notes</h4>
<div class="outline-text-4" id="text-org0a0432d">
<p>
Static or class functions in a class can be called through the class name.  When a class name is bound to an instance variable, you can invoke a specific static/class function in the class by prefixing the instance variable.  For example, here is a line in the function <code>backprop()</code>:
</p>

<div class="org-src-container">
<pre class="src src-python">a_prime = (self.act_output).derivative(zs[-1])
</pre>
</div>

<p>
So whatever <code>self.act_output</code> is bound to (e.g. Sigmoid, Tanh, ReLU), the function <code>derivative()</code> defined inside the class is being invoked.
</p>
</div>
</div>
</div>
