hw5/hw5-files/index.tex

\subsubsection*{4. regularization:}
\label{sec:org0a83846}
\begin{itemize}
\item This parameter specifies the regularization method.
\item Parameter options are 'L2' and 'L1'.
\item The selected method is applied to all hidden layers and the output layer.

\item You can implement them in any way you like, for example as function classes or inline if-else conditionals.  For definitions/formulas and explanation, see the \href{https://depaul.zoom.us/rec/share/HUia84Y0b\_OkQT2c9n39dGkUlyvNU0LqtmnnCz7gQ0vJ50hF\_up4sU0YWa4ABBQ.SS5hVQmvqRtOWFPa}{Avoiding overfitting} video from Week 3 or the review slides from Week 4.

\uline{IMPORTANT}: The start-up code has L2 hard-coded in (unchanged from the original NNDL code for this part).  \textbf{You make necessary changes to the code by yourself} to incorporate the two methods.
\item The regularization is relevant at two places in the backprop algorithm:
\begin{enumerate}
\item During training, when weights are adjusted at the end of a mini-bath -- the function \texttt{update\_mini\_batch()}.
\item During evaluation, when the cost is computed -- the function \texttt{total\_cost()}.
\end{enumerate}

NOTE: Both of those functions have the parameter \textbf{lmbda}, passed in from the function \texttt{SGD()}.  You utilize its value in implementing the regularizations.
\end{itemize}

\subsubsection*{5. dropoutpercent}
\label{sec:orge14d810}
\begin{itemize}
\item This parameter specifies the percentage of dropout.
\item The value is between 0 and 1.  For example, 0.4 means 40\% of the nodes on a layer are dropped (or made inaccessible).
\item Dropout consists in randomly setting a fraction rate of units in a layer to 0 at each update during training time, which helps prevent overfitting.
\item Assume the same dropout percentage is applied to \textbf{all hidden layers}.  \emph{Dropout should not be applied to input or output layer.}
\item You can implement the parameter in any way you like.  \textbf{You make necessary changes to the code by yourself, wherever needed.}
\item Many dropout schemes have been proposed in neural networks.  For this assignment, you implement the following scheme.
\begin{enumerate}
\item Dropout is applied during the \textbf{training phase only}.  No dropout is applied during the testing/evaluation phrase.
\item Use the same dropout nodes during one \textbf{mini-batch}.  That means you have to store which nodes were used/dropped somewhere else.  Think about it and implement in your way.
\item \textbf{Scale} the output values of the layer.  This scheme is explained at \href{https://wiseodd.github.io/techblog/2016/06/25/dropout/}{this site}.  In particular, the following code is very useful. The first line is generating a dropout mask (\texttt{u1}) and the second line is applying the mask to the activation of a hidden layer (\texttt{h1}) during the \textbf{forward} propagation phase in the backprop function.
\begin{verbatim}
# Dropout training, notice the scaling of 1/p
u1 = np.random.binomial(1, p, size=h1.shape) / p
h1 *= u1
\end{verbatim}

Then during the \textbf{backward} propagation phase, you apply the mask to the delta of a hidden layer (\texttt{dh1}).    This is necessary because, since a dropout mask is applied as an additional multiplier (function) after the activation function, it essentially became a constant coefficient of the activation function (i.e., \texttt{c*a(z)}), and shows up in the derivative of that function --  Let \(f(z) = c*a(z)\), then \(f'(z) = c*a'(z)\).

\begin{verbatim}
dh1 *= u1 
\end{verbatim}

\uline{IMPORTANT NOTES}:

\begin{itemize}
\item The variable \texttt{p} above is the ratio of nodes to RETAIN, not to remove.   So essentially, \texttt{p = 1 - self.dropoutpercent}.
\item \texttt{np.random.binomial()} is \textbf{probabilistic}, so does not guarantee the p proportion of success.  But for the purpose of the assignment, it's fine to use it (i.e., the code above).  However, if you like to implement correctly, you can use \texttt{random.sample()} method in Python's standard library.
\item During forward propagation, dropout should be applied to/after \textbf{activation}, NOT to the z/weighted sum (e.g. sigma(0) = 0.5, which is not right or convenient here).
\item During backward propagation, dropout should be applied to the delta (the error at a given hidden layer).
\end{itemize}
\end{enumerate}
\end{itemize}



\subsubsection*{Class Function notes}
\label{sec:org77df2bb}

Static or class functions in a class can be called through the class name.  When a class name is bound to an instance variable, you can invoke a specific static/class function in the class by prefixing the instance variable.  For example, here is a line in the function \texttt{backprop()}:

\begin{verbatim}
a_prime = (self.act_output).derivative(zs[-1])
\end{verbatim}

So whatever \texttt{self.act\_output} is bound to (e.g. Sigmoid, Tanh, ReLU), the function \texttt{derivative()} defined inside the class is being invoked.
