hw5/hw5-files/index.org
** (B) Functions to modify.

In addition to =set_parameters(), feedforward(), backprop(), update_mini_batch()= and =total_cost()=, you need to modify other parts of the code to implement *dropout*.  It's up to you to figure out and decide. 

/Whatever you did, you should *describe and explain* it in the documentation./  You may not get full points if modifications you made were not explained sufficiently.


* 2. Application code (Start-up code: [[./578hw5.ipynb][578hw5.ipynb]],html: [[./578hw5.html][578hw5.html]])
  
  Write Jupyter Notebook code to do these experiments using the iris dataset.  Ensure your code works for each experiment, and show the output in an Jupyter notebook.

  Just like HW#3, use the iris dataset [[./iris.csv][iris.csv]] and the [[./iris-423.dat][iris-423.dat]] network file to create an initial network.  You may play with the learning rate (eta / \eta) and mini_batch size on your own.

  Do the following experiments.  For each experiment, train the network using [[./iris-train-1.csv][iris-train-1.csv]] for *15 epochs* (only) and test it using [[./iris-test-1.csv][iris-test-1.csv]].

Note the output results in the right-most column were generated on [[https://labs.cognitiveclass.ai/][IBM CognitiveClassLab]].

|    | act_hidden | act_output | cost          | regularization | lmbda | dropout | OUTPUT        |
|----+------------+------------+---------------+----------------+-------+---------+---------------|
|  1 | Sigmoid    | Sigmoid    | Quadratic     | (default)      |   0.0 |     0.0 | [[./Result-1.txt][Result-1.txt]] |
|  2 | Sigmoid    | Sigmoid    | CrossEntropy  | (default)      |   0.0 |     0.0 | [[./Result-2.txt][Result-2.txt]] |
|  3 | Sigmoid    | Softmax    | CrossEntropy  | (default)      |   0.0 |     0.0 | [[./Result-3.txt][Result-3.txt]] |
|  4 | Sigmoid    | Softmax    | LogLikelihood | (default)      |   0.0 |     0.0 | [[./Result-4.txt][Result-4.txt]] |
|  5 | ReLU       | Softmax    | CrossEntropy  | (default)      |   0.0 |     0.0 | [[./Result-5.txt][Result-5.txt]] |
|  6 | ReLU       | Softmax    | LogLikelihood | (default)      |   0.0 |     0.0 | [[./Result-6.txt][Result-6.txt]] |
|  7 | Tanh       | Sigmoid    | Quadratic     | (default)      |   0.0 |     0.0 | [[./Result-7.txt][Result-7.txt]] |
|  8 | Tanh       | Tanh       | Quadratic     | (default)      |   0.0 |     0.0 | [[./Result-8.txt][Result-8.txt]] |
|  9 | Sigmoid    | Sigmoid    | Quadratic     | L2             |   3.0 |     0.0 | [[./Result-9.txt][Result-9.txt]] |
| 10 | Sigmoid    | Sigmoid    | Quadratic     | L1             |   3.0 |     0.0 | [[./Result-10.txt][Result-10.txt]] |

For the experiments below, use [[./iris4-20-7-3.dat][iris4-20-7-3.dat]]. Note that results may vary for these experiments because dropout nodes are randomly (but probabilistically) chosen.

|    | act_hidden | act_output | cost      | regularization | lmbda | dropout | OUTPUT        |
|----+------------+------------+-----------+----------------+-------+---------+---------------|
| 11 | Sigmoid    | Sigmoid    | Quadratic | (default)      |   0.0 |     0.1 | [[./Result-11.txt][Result-11.txt]] |
| 12 | Sigmoid    | Sigmoid    | Quadratic | (default)      |   0.0 |     0.5 | [[./Result-12.txt][Result-12.txt]] |

Note that those are the absolute minimal experiments.  Although not required for this homework, you should try other combinations of hyper-parameters to test your code more thoroughly and rigorously.

-----
