hw5/hw5-files/index.html

<div id="outline-container-org581fd27" class="outline-3">
<h3 id="org581fd27">(B) Functions to modify.</h3>
<div class="outline-text-3" id="text-org581fd27">
<p>
In addition to <code>set_parameters(), feedforward(), backprop(), update_mini_batch()</code> and <code>total_cost()</code>, you need to modify other parts of the code to implement <b>dropout</b>.  It's up to you to figure out and decide. 
</p>

<p>
<i>Whatever you did, you should <b>describe and explain</b> it in the documentation.</i>  You may not get full points if modifications you made were not explained sufficiently.
</p>
</div>
</div>
</div>


<div id="outline-container-orge2c79be" class="outline-2">
<h2 id="orge2c79be">2. Application code (Start-up code: <a href="./578hw5.ipynb">578hw5.ipynb</a>,html: <a href="./578hw5.html">578hw5.html</a>)</h2>
<div class="outline-text-2" id="text-orge2c79be">
<p>
Write Jupyter Notebook code to do these experiments using the iris dataset.  Ensure your code works for each experiment, and show the output in an Jupyter notebook.
</p>

<p>
Just like HW#3, use the iris dataset <a href="./iris.csv">iris.csv</a> and the <a href="./iris-423.dat">iris-423.dat</a> network file to create an initial network.  You may play with the learning rate (eta / &eta;) and mini_batch size on your own.
</p>

<p>
Do the following experiments.  For each experiment, train the network using <a href="./iris-train-1.csv">iris-train-1.csv</a> for <b>15 epochs</b> (only) and test it using <a href="./iris-test-1.csv">iris-test-1.csv</a>.
</p>

<p>
Note the output results in the right-most column were generated on <a href="https://labs.cognitiveclass.ai/">IBM CognitiveClassLab</a>.
</p>

<table>


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">act_hidden</th>
<th scope="col" class="org-left">act_output</th>
<th scope="col" class="org-left">cost</th>
<th scope="col" class="org-left">regularization</th>
<th scope="col" class="org-right">lmbda</th>
<th scope="col" class="org-right">dropout</th>
<th scope="col" class="org-left">OUTPUT</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-1.txt">Result-1.txt</a></td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">CrossEntropy</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-2.txt">Result-2.txt</a></td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Softmax</td>
<td class="org-left">CrossEntropy</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-3.txt">Result-3.txt</a></td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Softmax</td>
<td class="org-left">LogLikelihood</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-4.txt">Result-4.txt</a></td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">ReLU</td>
<td class="org-left">Softmax</td>
<td class="org-left">CrossEntropy</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-5.txt">Result-5.txt</a></td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">ReLU</td>
<td class="org-left">Softmax</td>
<td class="org-left">LogLikelihood</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-6.txt">Result-6.txt</a></td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Tanh</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-7.txt">Result-7.txt</a></td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Tanh</td>
<td class="org-left">Tanh</td>
<td class="org-left">Quadratic</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-8.txt">Result-8.txt</a></td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">L2</td>
<td class="org-right">3.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-9.txt">Result-9.txt</a></td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">L1</td>
<td class="org-right">3.0</td>
<td class="org-right">0.0</td>
<td class="org-left"><a href="./Result-10.txt">Result-10.txt</a></td>
</tr>
</tbody>
</table>

<p>
For the experiments below, use <a href="./iris4-20-7-3.dat">iris4-20-7-3.dat</a>. Note that results may vary for these experiments because dropout nodes are randomly (but probabilistically) chosen.
</p>

<table>


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">act_hidden</th>
<th scope="col" class="org-left">act_output</th>
<th scope="col" class="org-left">cost</th>
<th scope="col" class="org-left">regularization</th>
<th scope="col" class="org-right">lmbda</th>
<th scope="col" class="org-right">dropout</th>
<th scope="col" class="org-left">OUTPUT</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">11</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.1</td>
<td class="org-left"><a href="./Result-11.txt">Result-11.txt</a></td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Sigmoid</td>
<td class="org-left">Quadratic</td>
<td class="org-left">(default)</td>
<td class="org-right">0.0</td>
<td class="org-right">0.5</td>
<td class="org-left"><a href="./Result-12.txt">Result-12.txt</a></td>
</tr>
</tbody>
</table>

<p>
Note that those are the absolute minimal experiments.  Although not required for this homework, you should try other combinations of hyper-parameters to test your code more thoroughly and rigorously.
</p>

<hr />
</div>
</div>
