hw5/hw5-files/index.tex

\subsection*{(B) Functions to modify.}
\label{sec:org9f8af38}

In addition to \texttt{set\_parameters(), feedforward(), backprop(), update\_mini\_batch()} and \texttt{total\_cost()}, you need to modify other parts of the code to implement \textbf{dropout}.  It's up to you to figure out and decide. 

\emph{Whatever you did, you should \textbf{describe and explain} it in the documentation.}  You may not get full points if modifications you made were not explained sufficiently.


\section*{2. Application code (Start-up code: \href{./578hw5.ipynb}{578hw5.ipynb},html: \href{./578hw5.html}{578hw5.html})}
\label{sec:org13dcc25}

Write Jupyter Notebook code to do these experiments using the iris dataset.  Ensure your code works for each experiment, and show the output in an Jupyter notebook.

Just like HW\#3, use the iris dataset \href{./iris.csv}{iris.csv} and the \href{./iris-423.dat}{iris-423.dat} network file to create an initial network.  You may play with the learning rate (eta / \(\eta\)) and mini\_batch size on your own.

Do the following experiments.  For each experiment, train the network using \href{./iris-train-1.csv}{iris-train-1.csv} for \textbf{15 epochs} (only) and test it using \href{./iris-test-1.csv}{iris-test-1.csv}.

Note the output results in the right-most column were generated on \href{https://labs.cognitiveclass.ai/}{IBM CognitiveClassLab}.

\begin{center}
\begin{tabular}{rllllrrl}
 & act\_hidden & act\_output & cost & regularization & lmbda & dropout & OUTPUT\\
\hline
1 & Sigmoid & Sigmoid & Quadratic & (default) & 0.0 & 0.0 & \href{./Result-1.txt}{Result-1.txt}\\
2 & Sigmoid & Sigmoid & CrossEntropy & (default) & 0.0 & 0.0 & \href{./Result-2.txt}{Result-2.txt}\\
3 & Sigmoid & Softmax & CrossEntropy & (default) & 0.0 & 0.0 & \href{./Result-3.txt}{Result-3.txt}\\
4 & Sigmoid & Softmax & LogLikelihood & (default) & 0.0 & 0.0 & \href{./Result-4.txt}{Result-4.txt}\\
5 & ReLU & Softmax & CrossEntropy & (default) & 0.0 & 0.0 & \href{./Result-5.txt}{Result-5.txt}\\
6 & ReLU & Softmax & LogLikelihood & (default) & 0.0 & 0.0 & \href{./Result-6.txt}{Result-6.txt}\\
7 & Tanh & Sigmoid & Quadratic & (default) & 0.0 & 0.0 & \href{./Result-7.txt}{Result-7.txt}\\
8 & Tanh & Tanh & Quadratic & (default) & 0.0 & 0.0 & \href{./Result-8.txt}{Result-8.txt}\\
9 & Sigmoid & Sigmoid & Quadratic & L2 & 3.0 & 0.0 & \href{./Result-9.txt}{Result-9.txt}\\
10 & Sigmoid & Sigmoid & Quadratic & L1 & 3.0 & 0.0 & \href{./Result-10.txt}{Result-10.txt}\\
\end{tabular}
\end{center}

For the experiments below, use \href{./iris4-20-7-3.dat}{iris4-20-7-3.dat}. Note that results may vary for these experiments because dropout nodes are randomly (but probabilistically) chosen.

\begin{center}
\begin{tabular}{rllllrrl}
 & act\_hidden & act\_output & cost & regularization & lmbda & dropout & OUTPUT\\
\hline
11 & Sigmoid & Sigmoid & Quadratic & (default) & 0.0 & 0.1 & \href{./Result-11.txt}{Result-11.txt}\\
12 & Sigmoid & Sigmoid & Quadratic & (default) & 0.0 & 0.5 & \href{./Result-12.txt}{Result-12.txt}\\
\end{tabular}
\end{center}

Note that those are the absolute minimal experiments.  Although not required for this homework, you should try other combinations of hyper-parameters to test your code more thoroughly and rigorously.

\noindent\rule{\textwidth}{0.5pt}
