hw5/hw5-files/index.org
* Submission

  

  1. Completed "NN578_network2.py", and the application Notebook file and its html version.  Be sure to add your *name, course/section number* and the *assignment name* at the top of all code files.
  2. Documentation. 
     - *In pdf only.*
     - A /minimum/ of 2.0 pages (i.e., two pages filled, and some in the next page). 
     - Write as much as you can.  I consider terse answers insufficient, therefore won't give a full credit when I grade.
     - Create a presentable document. Don't make me work hard to find the information I asked for. (There are a lot of these to read.)
     - Content should include:
       - Your *name, course/section number* and the *assignment name* at the top of the file.
       - Then, in separate, labeled sections, include:
         - Experiment results :: Whether or not your results for the first *10 experiments* in the 'Application code' section above matched with the given results.  If your results were different, describe the discrepancies and what you speculated the discrepancies came from.
         - Implementation :: Explain how you implemented each of the requirements, and for each if they were *Complete*, meaning you did the code and verified that it worked; *Not attempted*, meaning you didn't get there; or *Partial*, meaning that you have some code but it did not completely work, and explain why.  Give as detailed explanations as possible.  In particular, be sure to explain everything you did to implement Dropout correctly.
         - Reflections :: Your reaction and reflection on this assignment overall (e.g. difficulty level, challenges you had).
     - Write as much as you can.  Try to make a *thorough and well-organized report*.  It's not to impress me; it's for your exercise.
     - Also some kind of graphs/plots are nice (to make a more professional presentation), although no extra credits are given this time.



DO NOT Zip the files -- Submit files separately.
