hw5/hw5-files/index.html
<div id="outline-container-orgd1435b1" class="outline-2">
<h2 id="orgd1435b1">Submission</h2>
<div class="outline-text-2" id="text-orgd1435b1">
<ol class="org-ol">
<li>Completed "NN578_network2.py", and the application Notebook file and its html version.  Be sure to add your <b>name, course/section number</b> and the <b>assignment name</b> at the top of all code files.</li>
<li>Documentation. 
<ul class="org-ul">
<li><b>In pdf only.</b></li>
<li>A <i>minimum</i> of 2.0 pages (i.e., two pages filled, and some in the next page).</li>
<li>Write as much as you can.  I consider terse answers insufficient, therefore won't give a full credit when I grade.</li>
<li>Create a presentable document. Don't make me work hard to find the information I asked for. (There are a lot of these to read.)</li>
<li>Content should include:
<ul class="org-ul">
<li>Your <b>name, course/section number</b> and the <b>assignment name</b> at the top of the file.</li>
<li>Then, in separate, labeled sections, include:
<dl class="org-dl">
<dt>Experiment results</dt><dd>Whether or not your results for the first <b>10 experiments</b> in the 'Application code' section above matched with the given results.  If your results were different, describe the discrepancies and what you speculated the discrepancies came from.</dd>
<dt>Implementation</dt><dd>Explain how you implemented each of the requirements, and for each if they were <b>Complete</b>, meaning you did the code and verified that it worked; <b>Not attempted</b>, meaning you didn't get there; or <b>Partial</b>, meaning that you have some code but it did not completely work, and explain why.  Give as detailed explanations as possible.  In particular, be sure to explain everything you did to implement Dropout correctly.</dd>
<dt>Reflections</dt><dd>Your reaction and reflection on this assignment overall (e.g. difficulty level, challenges you had).</dd>
</dl></li>
</ul></li>
<li>Write as much as you can.  Try to make a <b>thorough and well-organized report</b>.  It's not to impress me; it's for your exercise.</li>
<li>Also some kind of graphs/plots are nice (to make a more professional presentation), although no extra credits are given this time.</li>
</ul></li>
</ol>



<p>
DO NOT Zip the files &#x2013; Submit files separately.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr/><p class="author">Fall 2020 (<a href="mailto:"></a>) 2020-10-18 Sun 19:19</p>
</div>
</body>
</html>
