hw5/hw5-files/index.tex
\section*{Submission}
\label{sec:orge96bef3}



\begin{enumerate}
\item Completed "NN578\_network2.py", and the application Notebook file and its html version.  Be sure to add your \textbf{name, course/section number} and the \textbf{assignment name} at the top of all code files.
\item Documentation. 
\begin{itemize}
\item \textbf{In pdf only.}
\item A \emph{minimum} of 2.0 pages (i.e., two pages filled, and some in the next page).
\item Write as much as you can.  I consider terse answers insufficient, therefore won't give a full credit when I grade.
\item Create a presentable document. Don't make me work hard to find the information I asked for. (There are a lot of these to read.)
\item Content should include:
\begin{itemize}
\item Your \textbf{name, course/section number} and the \textbf{assignment name} at the top of the file.
\item Then, in separate, labeled sections, include:
\begin{description}
\item[{Experiment results}] Whether or not your results for the first \textbf{10 experiments} in the 'Application code' section above matched with the given results.  If your results were different, describe the discrepancies and what you speculated the discrepancies came from.
\item[{Implementation}] Explain how you implemented each of the requirements, and for each if they were \textbf{Complete}, meaning you did the code and verified that it worked; \textbf{Not attempted}, meaning you didn't get there; or \textbf{Partial}, meaning that you have some code but it did not completely work, and explain why.  Give as detailed explanations as possible.  In particular, be sure to explain everything you did to implement Dropout correctly.
\item[{Reflections}] Your reaction and reflection on this assignment overall (e.g. difficulty level, challenges you had).
\end{description}
\end{itemize}
\item Write as much as you can.  Try to make a \textbf{thorough and well-organized report}.  It's not to impress me; it's for your exercise.
\item Also some kind of graphs/plots are nice (to make a more professional presentation), although no extra credits are given this time.
\end{itemize}
\end{enumerate}



DO NOT Zip the files -- Submit files separately.
\end{document}
